---
title: FamilySymbolProfile
classe: Autodesk.Revit.DB.FamilySymbolProfile
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.SweepProfile
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# FamilySymbolProfile

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Angle { get; set; }` | `familySymbolProfile.Angle` | Double |
| `Boolean IsFlipped { get; set; }` | `familySymbolProfile.IsFlipped` | Boolean |
| `FamilySymbol Profile { get; set; }` | `familySymbolProfile.Profile` | FamilySymbol |
| `Double XOffset { get; set; }` | `familySymbolProfile.XOffset` | Double |
| `Double YOffset { get; set; }` | `familySymbolProfile.YOffset` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```